OLLYDOTDEV/Throttle_Body_Control_Platform/CODE/Research_And_Development/Matlab/CONTROL_SYSTEM/ESP32_CONTROL_SYSTEM_ert_rtw/ESP32_CONTROL_SYSTEM.c
/*
 * Community and Technical College License -- for use in teaching and
 * meeting course requirements at community and technical colleges only.
 * Not for government, commercial, university, or other organizational
 * use.
 *
 * File: ESP32_CONTROL_SYSTEM.c
 *
 * Code generated for Simulink model 'ESP32_CONTROL_SYSTEM'.
 *
 * Model version                  : 1.20
 * Simulink Coder version         : 24.1 (R2024a) 19-Nov-2023
 * C/C++ source code generated on : Tue Aug 20 20:09:56 2024
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: ARM Compatible->ARM Cortex
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#include "ESP32_CONTROL_SYSTEM.h"
#include "ESP32_CONTROL_SYSTEM_types.h"
#include "ESP32_CONTROL_SYSTEM_private.h"
#include "rtwtypes.h"
#include "rt_nonfinite.h"
#include <math.h>

/* Block signals (default storage) */
B_ESP32_CONTROL_SYSTEM_T ESP32_CONTROL_SYSTEM_B;

/* Continuous states */
X_ESP32_CONTROL_SYSTEM_T ESP32_CONTROL_SYSTEM_X;

/* Disabled State Vector */
XDis_ESP32_CONTROL_SYSTEM_T ESP32_CONTROL_SYSTEM_XDis;

/* Block states (default storage) */
DW_ESP32_CONTROL_SYSTEM_T ESP32_CONTROL_SYSTEM_DW;

/* Real-time model */
static RT_MODEL_ESP32_CONTROL_SYSTEM_T ESP32_CONTROL_SYSTEM_M_;
RT_MODEL_ESP32_CONTROL_SYSTEM_T *const ESP32_CONTROL_SYSTEM_M =
  &ESP32_CONTROL_SYSTEM_M_;

/* Forward declaration for local functions */
static void ESP32_CONTRO_SystemCore_release(codertarget_arduinobase_inter_T *obj);

/*
 * This function updates continuous states using the ODE3 fixed-step
 * solver algorithm
 */
static void rt_ertODEUpdateContinuousStates(RTWSolverInfo *si )
{
  /* Solver Matrices */
  static const real_T rt_ODE3_A[3] = {
    1.0/2.0, 3.0/4.0, 1.0
  };

  static const real_T rt_ODE3_B[3][3] = {
    { 1.0/2.0, 0.0, 0.0 },

    { 0.0, 3.0/4.0, 0.0 },

    { 2.0/9.0, 1.0/3.0, 4.0/9.0 }
  };

  time_T t = rtsiGetT(si);
  time_T tnew = rtsiGetSolverStopTime(si);
  time_T h = rtsiGetStepSize(si);
  real_T *x = rtsiGetContStates(si);
  ODE3_IntgData *id = (ODE3_IntgData *)rtsiGetSolverData(si);
  real_T *y = id->y;
  real_T *f0 = id->f[0];
  real_T *f1 = id->f[1];
  real_T *f2 = id->f[2];
  real_T hB[3];
  int_T i;
  int_T nXc = 1;
  rtsiSetSimTimeStep(si,MINOR_TIME_STEP);

  /* Save the state values at time t in y, we'll use x as ynew. */
  (void) memcpy(y, x,
                (uint_T)nXc*sizeof(real_T));

  /* Assumes that rtsiSetT and ModelOutputs are up-to-date */
  /* f0 = f(t,y) */
  rtsiSetdX(si, f0);
  ESP32_CONTROL_SYSTEM_derivatives();

  /* f(:,2) = feval(odefile, t + hA(1), y + f*hB(:,1), args(:)(*)); */
  hB[0] = h * rt_ODE3_B[0][0];
  for (i = 0; i < nXc; i++) {
    x[i] = y[i] + (f0[i]*hB[0]);
  }

  rtsiSetT(si, t + h*rt_ODE3_A[0]);
  rtsiSetdX(si, f1);
  ESP32_CONTROL_SYSTEM_step();
  ESP32_CONTROL_SYSTEM_derivatives();

  /* f(:,3) = feval(odefile, t + hA(2), y + f*hB(:,2), args(:)(*)); */
  for (i = 0; i <= 1; i++) {
    hB[i] = h * rt_ODE3_B[1][i];
  }

  for (i = 0; i < nXc; i++) {
    x[i] = y[i] + (f0[i]*hB[0] + f1[i]*hB[1]);
  }

  rtsiSetT(si, t + h*rt_ODE3_A[1]);
  rtsiSetdX(si, f2);
  ESP32_CONTROL_SYSTEM_step();
  ESP32_CONTROL_SYSTEM_derivatives();

  /* tnew = t + hA(3);
     ynew = y + f*hB(:,3); */
  for (i = 0; i <= 2; i++) {
    hB[i] = h * rt_ODE3_B[2][i];
  }

  for (i = 0; i < nXc; i++) {
    x[i] = y[i] + (f0[i]*hB[0] + f1[i]*hB[1] + f2[i]*hB[2]);
  }

  rtsiSetT(si, tnew);
  rtsiSetSimTimeStep(si,MAJOR_TIME_STEP);
}

real_T rt_roundd_snf(real_T u)
{
  real_T y;
  if (fabs(u) < 4.503599627370496E+15) {
    if (u >= 0.5) {
      y = floor(u + 0.5);
    } else if (u > -0.5) {
      y = u * 0.0;
    } else {
      y = ceil(u - 0.5);
    }
  } else {
    y = u;
  }

  return y;
}

static void ESP32_CONTRO_SystemCore_release(codertarget_arduinobase_inter_T *obj)
{
  /* Start for MATLABSystem: '<S3>/PWM' */
  if ((obj->isInitialized == 1) && obj->isSetupComplete) {
    obj->PWMDriverObj.MW_PWM_HANDLE = MW_PWM_GetHandle(2U);
    MW_PWM_SetDutyCycle(obj->PWMDriverObj.MW_PWM_HANDLE, -0.0);
    obj->PWMDriverObj.MW_PWM_HANDLE = MW_PWM_GetHandle(2U);
    MW_PWM_Close(obj->PWMDriverObj.MW_PWM_HANDLE);
  }

  /* End of Start for MATLABSystem: '<S3>/PWM' */
}

/* Model step function */
void ESP32_CONTROL_SYSTEM_step(void)
{
  if (rtmIsMajorTimeStep(ESP32_CONTROL_SYSTEM_M)) {
    /* set solver stop time */
    rtsiSetSolverStopTime(&ESP32_CONTROL_SYSTEM_M->solverInfo,
                          ((ESP32_CONTROL_SYSTEM_M->Timing.clockTick0+1)*
      ESP32_CONTROL_SYSTEM_M->Timing.stepSize0));
  }                                    /* end MajorTimeStep */

  /* Update absolute time of base rate at minor time step */
  if (rtmIsMinorTimeStep(ESP32_CONTROL_SYSTEM_M)) {
    ESP32_CONTROL_SYSTEM_M->Timing.t[0] = rtsiGetT
      (&ESP32_CONTROL_SYSTEM_M->solverInfo);
  }

  {
    real_T lastTime;
    real_T rtb_Sum;
    real_T *lastU;
    int32_T rowIdx;
    int8_T rtAction;
    int8_T rtPrevAction;
    uint8_T tmp;

    /* Reset subsysRan breadcrumbs */
    srClearBC(ESP32_CONTROL_SYSTEM_DW.IfActionSubsystem_SubsysRanBC);

    /* Reset subsysRan breadcrumbs */
    srClearBC(ESP32_CONTROL_SYSTEM_DW.PIDControl_SubsysRanBC);
    if (rtmIsMajorTimeStep(ESP32_CONTROL_SYSTEM_M)) {
      /* CombinatorialLogic: '<S13>/Logic' incorporates:
       *  Constant: '<S7>/Constant'
       *  Constant: '<S7>/Constant2'
       *  Constant: '<S7>/Constant3'
       *  Logic: '<S7>/Logical Operator12'
       *  Logic: '<S7>/Logical Operator13'
       *  Logic: '<S7>/Logical Operator14'
       *  Logic: '<S7>/Logical Operator15'
       *  Logic: '<S7>/Logical Operator3'
       *  Memory: '<S13>/Memory'
       */
      rowIdx = (int32_T)(((((uint32_T)((ESP32_CONTROL_SYSTEM_P.Constant3_Value
        != 0.0) && ((!(ESP32_CONTROL_SYSTEM_P.Constant2_Value != 0.0)) &&
                    (!(ESP32_CONTROL_SYSTEM_P.Constant_Value != 0.0)))) << 1) +
                           (uint32_T)(int8_T)((int8_T)
        (ESP32_CONTROL_SYSTEM_P.Constant_Value != 0.0) ^ (int8_T)
        (ESP32_CONTROL_SYSTEM_P.Constant2_Value != 0.0))) << 1) +
                         ESP32_CONTROL_SYSTEM_DW.Memory_PreviousInput);
      ESP32_CONTROL_SYSTEM_B.Logic[0U] = ESP32_CONTROL_SYSTEM_P.Logic_table
        [(uint32_T)rowIdx];
      ESP32_CONTROL_SYSTEM_B.Logic[1U] = ESP32_CONTROL_SYSTEM_P.Logic_table
        [(uint32_T)rowIdx + 8U];

