OLLYDOTDEV/Throttle_Body_Control_Platform/CODE/Research_And_Development/Matlab/CONTROL_SYSTEM/ESP32_CONTROL_SYSTEM_ert_rtw/ESP32_CONTROL_SYSTEM.c
      /* CombinatorialLogic: '<S11>/Logic' incorporates:
       *  Constant: '<S7>/Constant'
       *  Constant: '<S7>/Constant2'
       *  Constant: '<S7>/Constant3'
       *  Logic: '<S7>/Logical Operator1'
       *  Logic: '<S7>/Logical Operator4'
       *  Logic: '<S7>/Logical Operator5'
       *  Logic: '<S7>/Logical Operator6'
       *  Logic: '<S7>/Logical Operator7'
       *  Memory: '<S11>/Memory'
       */
      rowIdx = (int32_T)(((((uint32_T)((ESP32_CONTROL_SYSTEM_P.Constant_Value !=
        0.0) && ((!(ESP32_CONTROL_SYSTEM_P.Constant3_Value != 0.0)) &&
                 (!(ESP32_CONTROL_SYSTEM_P.Constant2_Value != 0.0)))) << 1) +
                           (uint32_T)(int8_T)((int8_T)
        (ESP32_CONTROL_SYSTEM_P.Constant2_Value != 0.0) ^ (int8_T)
        (ESP32_CONTROL_SYSTEM_P.Constant3_Value != 0.0))) << 1) +
                         ESP32_CONTROL_SYSTEM_DW.Memory_PreviousInput_f);
      ESP32_CONTROL_SYSTEM_B.Logic_b[0U] = ESP32_CONTROL_SYSTEM_P.Logic_table_d
        [(uint32_T)rowIdx];
      ESP32_CONTROL_SYSTEM_B.Logic_b[1U] = ESP32_CONTROL_SYSTEM_P.Logic_table_d
        [(uint32_T)rowIdx + 8U];

      /* CombinatorialLogic: '<S12>/Logic' incorporates:
       *  Constant: '<S7>/Constant'
       *  Constant: '<S7>/Constant2'
       *  Constant: '<S7>/Constant3'
       *  Logic: '<S7>/Logical Operator10'
       *  Logic: '<S7>/Logical Operator11'
       *  Logic: '<S7>/Logical Operator2'
       *  Logic: '<S7>/Logical Operator8'
       *  Logic: '<S7>/Logical Operator9'
       *  Memory: '<S12>/Memory'
       */
      rowIdx = (int32_T)(((((uint32_T)((ESP32_CONTROL_SYSTEM_P.Constant2_Value
        != 0.0) && ((!(ESP32_CONTROL_SYSTEM_P.Constant_Value != 0.0)) &&
                    (!(ESP32_CONTROL_SYSTEM_P.Constant3_Value != 0.0)))) << 1) +
                           (uint32_T)(int8_T)((int8_T)
        (ESP32_CONTROL_SYSTEM_P.Constant_Value != 0.0) ^ (int8_T)
        (ESP32_CONTROL_SYSTEM_P.Constant3_Value != 0.0))) << 1) +
                         ESP32_CONTROL_SYSTEM_DW.Memory_PreviousInput_n);
      ESP32_CONTROL_SYSTEM_B.Logic_l[0U] =
        ESP32_CONTROL_SYSTEM_P.Logic_table_d2[(uint32_T)rowIdx];
      ESP32_CONTROL_SYSTEM_B.Logic_l[1U] =
        ESP32_CONTROL_SYSTEM_P.Logic_table_d2[(uint32_T)rowIdx + 8U];
    }

    /* MATLABSystem: '<S2>/ESP23_ANALOG_READ_DDAppGeneratedBlock1' */
    if (ESP32_CONTROL_SYSTEM_DW.obj_h.SampleTime !=
        ESP32_CONTROL_SYSTEM_P.ESP23_ANALOG_READ_DDAppGenerate) {
      ESP32_CONTROL_SYSTEM_DW.obj_h.SampleTime =
        ESP32_CONTROL_SYSTEM_P.ESP23_ANALOG_READ_DDAppGenerate;
    }

    /* MATLABSystem: '<S2>/ESP23_ANALOG_READ_DDAppGeneratedBlock1' */
    /*         %% Define output properties */
    ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenera_d = 0.0;
    stepFunctionESP32_ANALOG_READ(34,
      &ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenera_d, 1.0);

    /* MATLABSystem: '<S10>/ESP23_ANALOG_READ_DDAppGeneratedBlock' */
    if (ESP32_CONTROL_SYSTEM_DW.obj.SampleTime !=
        ESP32_CONTROL_SYSTEM_P.ESP23_ANALOG_READ_DDAppGenera_p) {
      ESP32_CONTROL_SYSTEM_DW.obj.SampleTime =
        ESP32_CONTROL_SYSTEM_P.ESP23_ANALOG_READ_DDAppGenera_p;
    }

    /* MATLABSystem: '<S10>/ESP23_ANALOG_READ_DDAppGeneratedBlock' */
    /*         %% Define output properties */
    ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenerate = 0.0;
    stepFunctionESP32_ANALOG_READ(35,
      &ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenerate, 1.0);
    if (rtmIsMajorTimeStep(ESP32_CONTROL_SYSTEM_M)) {
      /* MATLAB Function: '<Root>/Throttle Body Callibration' */
      if (ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenerate >
          ESP32_CONTROL_SYSTEM_DW.TB_maxSet) {
        ESP32_CONTROL_SYSTEM_DW.TB_maxSet =
          ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenerate;
      }

      if (ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenerate <
          ESP32_CONTROL_SYSTEM_DW.TB_minSet) {
        ESP32_CONTROL_SYSTEM_DW.TB_minSet =
          ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenerate;
      }

      ESP32_CONTROL_SYSTEM_B.TB_maxVal = ESP32_CONTROL_SYSTEM_DW.TB_maxSet;
      ESP32_CONTROL_SYSTEM_B.TB_minVal = ESP32_CONTROL_SYSTEM_DW.TB_minSet;

      /* End of MATLAB Function: '<Root>/Throttle Body Callibration' */

      /* Sum: '<S8>/Add' */
      ESP32_CONTROL_SYSTEM_B.Add = ESP32_CONTROL_SYSTEM_B.TB_maxVal -
        ESP32_CONTROL_SYSTEM_B.TB_minVal;

      /* MATLAB Function: '<Root>/Pedal Calibration' */
      if (ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenera_d >
          ESP32_CONTROL_SYSTEM_DW.maxSet) {
        ESP32_CONTROL_SYSTEM_DW.maxSet =
          ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenera_d;
      }

      if (ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenera_d <
          ESP32_CONTROL_SYSTEM_DW.minSet) {
        ESP32_CONTROL_SYSTEM_DW.minSet =
          ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenera_d;
      }

      ESP32_CONTROL_SYSTEM_B.FP_maxVal = ESP32_CONTROL_SYSTEM_DW.maxSet;
      ESP32_CONTROL_SYSTEM_B.FP_minVal = ESP32_CONTROL_SYSTEM_DW.minSet;

      /* End of MATLAB Function: '<Root>/Pedal Calibration' */

      /* Sum: '<S8>/Add1' */
      ESP32_CONTROL_SYSTEM_B.Add1 = ESP32_CONTROL_SYSTEM_B.FP_maxVal -
        ESP32_CONTROL_SYSTEM_B.FP_minVal;

      /* Product: '<S8>/Divide' */
      ESP32_CONTROL_SYSTEM_B.Divide = ESP32_CONTROL_SYSTEM_B.Add /
        ESP32_CONTROL_SYSTEM_B.Add1;
    }

    /* Product: '<S8>/Product' */
    ESP32_CONTROL_SYSTEM_B.Product =
      ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenerate *
      ESP32_CONTROL_SYSTEM_B.Divide;

    /* Sum: '<Root>/Sum2' */
    ESP32_CONTROL_SYSTEM_B.Sum2 =
      ESP32_CONTROL_SYSTEM_B.ESP23_ANALOG_READ_DDAppGenera_d -
      ESP32_CONTROL_SYSTEM_B.Product;

    /* If: '<Root>/If' */
    rtPrevAction = ESP32_CONTROL_SYSTEM_DW.If_ActiveSubsystem;
    if (rtsiIsModeUpdateTimeStep(&ESP32_CONTROL_SYSTEM_M->solverInfo)) {
      if (ESP32_CONTROL_SYSTEM_B.Logic[0]) {
        rtAction = 0;
      } else if (ESP32_CONTROL_SYSTEM_B.Logic_b[0]) {
        rtAction = 1;
      } else if (ESP32_CONTROL_SYSTEM_B.Logic_l[0]) {
        rtAction = 2;
      } else {
        rtAction = 3;
      }

      ESP32_CONTROL_SYSTEM_DW.If_ActiveSubsystem = rtAction;
    } else {
      rtAction = ESP32_CONTROL_SYSTEM_DW.If_ActiveSubsystem;
    }

