OLLYDOTDEV/Throttle_Body_Control_Platform/CODE/Research_And_Development/Matlab/CONTROL_SYSTEM/ESP32_CONTROL_SYSTEM_ert_rtw/ESP32_CONTROL_SYSTEM.c
    if (rtPrevAction != rtAction) {
      if (ESP32_CONTROL_SYSTEM_M->Timing.t[0] == rtmGetTStart
          (ESP32_CONTROL_SYSTEM_M)) {
        (void) memset(&(ESP32_CONTROL_SYSTEM_XDis.Integrator_CSTATE), 1,
                      1*sizeof(boolean_T));
      }

      if (rtPrevAction == 1) {
        (void) memset(&(ESP32_CONTROL_SYSTEM_XDis.Integrator_CSTATE), 1,
                      1*sizeof(boolean_T));
      }
    }

    switch (rtAction) {
     case 0:
      /* Outputs for IfAction SubSystem: '<Root>/If Action Subsystem' incorporates:
       *  ActionPort: '<S4>/Action Port'
       */
      /* SignalConversion generated from: '<S4>/In1' */
      ESP32_CONTROL_SYSTEM_B.In1 = ESP32_CONTROL_SYSTEM_B.Sum2;
      if (rtsiIsModeUpdateTimeStep(&ESP32_CONTROL_SYSTEM_M->solverInfo)) {
        srUpdateBC(ESP32_CONTROL_SYSTEM_DW.IfActionSubsystem_SubsysRanBC);
      }

      /* End of Outputs for SubSystem: '<Root>/If Action Subsystem' */
      break;

     case 1:
      if (rtAction != rtPrevAction) {
        /* Enable for IfAction SubSystem: '<Root>/PID Control' incorporates:
         *  ActionPort: '<S5>/Action Port'
         */
        /* Enable for If: '<Root>/If' */
        (void) memset(&(ESP32_CONTROL_SYSTEM_XDis.Integrator_CSTATE), 0,
                      1*sizeof(boolean_T));

        /* End of Enable for SubSystem: '<Root>/PID Control' */
      }

      /* Outputs for IfAction SubSystem: '<Root>/PID Control' incorporates:
       *  ActionPort: '<S5>/Action Port'
       */
      /* Derivative: '<S5>/Derivative' */
      rtb_Sum = ESP32_CONTROL_SYSTEM_M->Timing.t[0];
      if ((ESP32_CONTROL_SYSTEM_DW.TimeStampA >= rtb_Sum) &&
          (ESP32_CONTROL_SYSTEM_DW.TimeStampB >= rtb_Sum)) {
        rtb_Sum = 0.0;
      } else {
        lastTime = ESP32_CONTROL_SYSTEM_DW.TimeStampA;
        lastU = &ESP32_CONTROL_SYSTEM_DW.LastUAtTimeA;
        if (ESP32_CONTROL_SYSTEM_DW.TimeStampA <
            ESP32_CONTROL_SYSTEM_DW.TimeStampB) {
          if (ESP32_CONTROL_SYSTEM_DW.TimeStampB < rtb_Sum) {
            lastTime = ESP32_CONTROL_SYSTEM_DW.TimeStampB;
            lastU = &ESP32_CONTROL_SYSTEM_DW.LastUAtTimeB;
          }
        } else if (ESP32_CONTROL_SYSTEM_DW.TimeStampA >= rtb_Sum) {
          lastTime = ESP32_CONTROL_SYSTEM_DW.TimeStampB;
          lastU = &ESP32_CONTROL_SYSTEM_DW.LastUAtTimeB;
        }

        rtb_Sum = (ESP32_CONTROL_SYSTEM_B.Sum2 - *lastU) / (rtb_Sum - lastTime);
      }

      /* End of Derivative: '<S5>/Derivative' */

      /* Sum: '<S5>/Sum' incorporates:
       *  Gain: '<S5>/Kd'
       *  Gain: '<S5>/Ki'
       *  Gain: '<S5>/Kp'
       *  Integrator: '<S5>/Integrator'
       */
      ESP32_CONTROL_SYSTEM_B.Saturation = (ESP32_CONTROL_SYSTEM_P.Kp *
        ESP32_CONTROL_SYSTEM_B.Sum2 + ESP32_CONTROL_SYSTEM_P.Ki *
        ESP32_CONTROL_SYSTEM_X.Integrator_CSTATE) + ESP32_CONTROL_SYSTEM_P.Kd *
        rtb_Sum;

      /* Saturate: '<S5>/Saturation' */
      if (ESP32_CONTROL_SYSTEM_B.Saturation >
          ESP32_CONTROL_SYSTEM_P.Saturation_UpperSat) {
        /* Sum: '<S5>/Sum' incorporates:
         *  Saturate: '<S5>/Saturation'
         */
        ESP32_CONTROL_SYSTEM_B.Saturation =
          ESP32_CONTROL_SYSTEM_P.Saturation_UpperSat;
      } else if (ESP32_CONTROL_SYSTEM_B.Saturation <
                 ESP32_CONTROL_SYSTEM_P.Saturation_LowerSat) {
        /* Sum: '<S5>/Sum' incorporates:
         *  Saturate: '<S5>/Saturation'
         */
        ESP32_CONTROL_SYSTEM_B.Saturation =
          ESP32_CONTROL_SYSTEM_P.Saturation_LowerSat;
      }

      /* End of Saturate: '<S5>/Saturation' */
      if (rtsiIsModeUpdateTimeStep(&ESP32_CONTROL_SYSTEM_M->solverInfo)) {
        srUpdateBC(ESP32_CONTROL_SYSTEM_DW.PIDControl_SubsysRanBC);
      }

      /* End of Outputs for SubSystem: '<Root>/PID Control' */
      break;

     case 2:
      break;
    }

    /* End of If: '<Root>/If' */
    if (rtmIsMajorTimeStep(ESP32_CONTROL_SYSTEM_M)) {
      /* Sum: '<S1>/Add' incorporates:
       *  Constant: '<S1>/Desire Max Value'
       *  Constant: '<S1>/Desire Min Value'
       */
      ESP32_CONTROL_SYSTEM_B.Add_e = ESP32_CONTROL_SYSTEM_P.Desire_Max -
        ESP32_CONTROL_SYSTEM_P.Desire_Min;

      /* Sum: '<S1>/Add1' */
      ESP32_CONTROL_SYSTEM_B.Add1_m = ESP32_CONTROL_SYSTEM_B.FP_maxVal -
        ESP32_CONTROL_SYSTEM_B.FP_minVal;

      /* Switch: '<Root>/Switch1' */
      if (ESP32_CONTROL_SYSTEM_B.Logic_b[0]) {
        rtb_Sum = ESP32_CONTROL_SYSTEM_B.Saturation;
      } else {
        rtb_Sum = ESP32_CONTROL_SYSTEM_B.In1;
      }

      /* Product: '<S1>/Product' incorporates:
       *  Product: '<S1>/Divide'
       *  Switch: '<Root>/Switch1'
       */
      ESP32_CONTROL_SYSTEM_B.Product_i = ESP32_CONTROL_SYSTEM_B.Add_e /
        ESP32_CONTROL_SYSTEM_B.Add1_m * rtb_Sum;

      /* Start for MATLABSystem: '<S3>/PWM' */
      if (ESP32_CONTROL_SYSTEM_B.Product_i <= 255.0) {
        rtb_Sum = ESP32_CONTROL_SYSTEM_B.Product_i;
      } else {
        rtb_Sum = 255.0;
      }

      /* MATLABSystem: '<S3>/PWM' */
      ESP32_CONTROL_SYSTEM_DW.obj_l.PWMDriverObj.MW_PWM_HANDLE =
        MW_PWM_GetHandle(2U);

      /* Start for MATLABSystem: '<S3>/PWM' */
      if (!(rtb_Sum >= 0.0)) {
        rtb_Sum = 0.0;
      }

      /* MATLABSystem: '<S3>/PWM' */
      MW_PWM_SetDutyCycle
        (ESP32_CONTROL_SYSTEM_DW.obj_l.PWMDriverObj.MW_PWM_HANDLE, -(rtb_Sum *
          255.0 / 255.0));

      /* Constant: '<S3>/Enable Pin' */
      ESP32_CONTROL_SYSTEM_B.EnablePin = ESP32_CONTROL_SYSTEM_P.EN_Pin;

      /* MATLABSystem: '<S3>/Digital Output' */
      rtb_Sum = rt_roundd_snf(ESP32_CONTROL_SYSTEM_B.EnablePin);
      if (rtb_Sum < 256.0) {
        if (rtb_Sum >= 0.0) {
          tmp = (uint8_T)rtb_Sum;
        } else {
          tmp = 0U;
        }
      } else {
        tmp = MAX_uint8_T;
      }

      writeDigitalPin(4, tmp);

      /* End of MATLABSystem: '<S3>/Digital Output' */
      /* Constant: '<S3>/Direction Pin' */
      ESP32_CONTROL_SYSTEM_B.DirectionPin = ESP32_CONTROL_SYSTEM_P.Direction_Pin;

      /* MATLABSystem: '<S3>/Digital Output1' */
      rtb_Sum = rt_roundd_snf(ESP32_CONTROL_SYSTEM_B.DirectionPin);
      if (rtb_Sum < 256.0) {
        if (rtb_Sum >= 0.0) {
          tmp = (uint8_T)rtb_Sum;
        } else {
          tmp = 0U;
        }
      } else {
        tmp = MAX_uint8_T;
      }

      writeDigitalPin(0, tmp);

      /* End of MATLABSystem: '<S3>/Digital Output1' */
      /* MATLABSystem: '<S3>/MATLAB System' */
      if (ESP32_CONTROL_SYSTEM_DW.obj_o.SampleTime !=
          ESP32_CONTROL_SYSTEM_P.MATLABSystem_SampleTime) {
        ESP32_CONTROL_SYSTEM_DW.obj_o.SampleTime =
          ESP32_CONTROL_SYSTEM_P.MATLABSystem_SampleTime;
      }

      /*         %% Define output properties */
      stepFunctionLEDC_INTERFACE(0.0, 1.0);

