OLLYDOTDEV/Throttle_Body_Control_Platform/CODE/Research_And_Development/Matlab/CONTROL_SYSTEM/ESP32_CONTROL_SYSTEM_ert_rtw/ESP32_CONTROL_SYSTEM.c
      /* End of MATLABSystem: '<S3>/MATLAB System' */
    }
  }

  if (rtmIsMajorTimeStep(ESP32_CONTROL_SYSTEM_M)) {
    real_T *lastU;
    if (rtmIsMajorTimeStep(ESP32_CONTROL_SYSTEM_M)) {
      /* Update for Memory: '<S13>/Memory' */
      ESP32_CONTROL_SYSTEM_DW.Memory_PreviousInput =
        ESP32_CONTROL_SYSTEM_B.Logic[0];

      /* Update for Memory: '<S11>/Memory' */
      ESP32_CONTROL_SYSTEM_DW.Memory_PreviousInput_f =
        ESP32_CONTROL_SYSTEM_B.Logic_b[0];

      /* Update for Memory: '<S12>/Memory' */
      ESP32_CONTROL_SYSTEM_DW.Memory_PreviousInput_n =
        ESP32_CONTROL_SYSTEM_B.Logic_l[0];
    }

    /* Update for If: '<Root>/If' */
    if (ESP32_CONTROL_SYSTEM_DW.If_ActiveSubsystem == 1) {
      /* Update for IfAction SubSystem: '<Root>/PID Control' incorporates:
       *  ActionPort: '<S5>/Action Port'
       */
      /* Update for Derivative: '<S5>/Derivative' */
      if (ESP32_CONTROL_SYSTEM_DW.TimeStampA == (rtInf)) {
        ESP32_CONTROL_SYSTEM_DW.TimeStampA = ESP32_CONTROL_SYSTEM_M->Timing.t[0];
        lastU = &ESP32_CONTROL_SYSTEM_DW.LastUAtTimeA;
      } else if (ESP32_CONTROL_SYSTEM_DW.TimeStampB == (rtInf)) {
        ESP32_CONTROL_SYSTEM_DW.TimeStampB = ESP32_CONTROL_SYSTEM_M->Timing.t[0];
        lastU = &ESP32_CONTROL_SYSTEM_DW.LastUAtTimeB;
      } else if (ESP32_CONTROL_SYSTEM_DW.TimeStampA <
                 ESP32_CONTROL_SYSTEM_DW.TimeStampB) {
        ESP32_CONTROL_SYSTEM_DW.TimeStampA = ESP32_CONTROL_SYSTEM_M->Timing.t[0];
        lastU = &ESP32_CONTROL_SYSTEM_DW.LastUAtTimeA;
      } else {
        ESP32_CONTROL_SYSTEM_DW.TimeStampB = ESP32_CONTROL_SYSTEM_M->Timing.t[0];
        lastU = &ESP32_CONTROL_SYSTEM_DW.LastUAtTimeB;
      }

      *lastU = ESP32_CONTROL_SYSTEM_B.Sum2;

      /* End of Update for Derivative: '<S5>/Derivative' */
      /* End of Update for SubSystem: '<Root>/PID Control' */
    }

    /* End of Update for If: '<Root>/If' */
    if (rtmIsMajorTimeStep(ESP32_CONTROL_SYSTEM_M)) {/* Sample time: [0.05s, 0.0s] */
      extmodeErrorCode_T errorCode = EXTMODE_SUCCESS;
      extmodeSimulationTime_T currentTime = (extmodeSimulationTime_T)
        ((ESP32_CONTROL_SYSTEM_M->Timing.clockTick1) * 0.05);

      /* Trigger External Mode event */
      errorCode = extmodeEvent(1,currentTime);
      if (errorCode != EXTMODE_SUCCESS) {
        /* Code to handle External Mode event errors
           may be added here */
      }
    }
  }                                    /* end MajorTimeStep */

  if (rtmIsMajorTimeStep(ESP32_CONTROL_SYSTEM_M)) {
    rt_ertODEUpdateContinuousStates(&ESP32_CONTROL_SYSTEM_M->solverInfo);

    /* Update absolute time for base rate */
    /* The "clockTick0" counts the number of times the code of this task has
     * been executed. The absolute time is the multiplication of "clockTick0"
     * and "Timing.stepSize0". Size of "clockTick0" ensures timer will not
     * overflow during the application lifespan selected.
     */
    ++ESP32_CONTROL_SYSTEM_M->Timing.clockTick0;
    ESP32_CONTROL_SYSTEM_M->Timing.t[0] = rtsiGetSolverStopTime
      (&ESP32_CONTROL_SYSTEM_M->solverInfo);

    {
      /* Update absolute timer for sample time: [0.05s, 0.0s] */
      /* The "clockTick1" counts the number of times the code of this task has
       * been executed. The resolution of this integer timer is 0.05, which is the step size
       * of the task. Size of "clockTick1" ensures timer will not overflow during the
       * application lifespan selected.
       */
      ESP32_CONTROL_SYSTEM_M->Timing.clockTick1++;
    }
  }                                    /* end MajorTimeStep */
}

/* Derivatives for root system: '<Root>' */
void ESP32_CONTROL_SYSTEM_derivatives(void)
{
  XDot_ESP32_CONTROL_SYSTEM_T *_rtXdot;
  _rtXdot = ((XDot_ESP32_CONTROL_SYSTEM_T *) ESP32_CONTROL_SYSTEM_M->derivs);

  /* Derivatives for If: '<Root>/If' */
  ((XDot_ESP32_CONTROL_SYSTEM_T *) ESP32_CONTROL_SYSTEM_M->derivs)
    ->Integrator_CSTATE = 0.0;
  if (ESP32_CONTROL_SYSTEM_DW.If_ActiveSubsystem == 1) {
    /* Derivatives for IfAction SubSystem: '<Root>/PID Control' incorporates:
     *  ActionPort: '<S5>/Action Port'
     */
    /* Derivatives for Integrator: '<S5>/Integrator' */
    _rtXdot->Integrator_CSTATE = ESP32_CONTROL_SYSTEM_B.Sum2;

    /* End of Derivatives for SubSystem: '<Root>/PID Control' */
  }

  /* End of Derivatives for If: '<Root>/If' */
}

/* Model initialize function */
void ESP32_CONTROL_SYSTEM_initialize(void)
{
  /* Registration code */

  /* initialize non-finites */
  rt_InitInfAndNaN(sizeof(real_T));

  {
    /* Setup solver object */
    rtsiSetSimTimeStepPtr(&ESP32_CONTROL_SYSTEM_M->solverInfo,
                          &ESP32_CONTROL_SYSTEM_M->Timing.simTimeStep);
    rtsiSetTPtr(&ESP32_CONTROL_SYSTEM_M->solverInfo, &rtmGetTPtr
                (ESP32_CONTROL_SYSTEM_M));
    rtsiSetStepSizePtr(&ESP32_CONTROL_SYSTEM_M->solverInfo,
                       &ESP32_CONTROL_SYSTEM_M->Timing.stepSize0);
    rtsiSetdXPtr(&ESP32_CONTROL_SYSTEM_M->solverInfo,
                 &ESP32_CONTROL_SYSTEM_M->derivs);
    rtsiSetContStatesPtr(&ESP32_CONTROL_SYSTEM_M->solverInfo, (real_T **)
                         &ESP32_CONTROL_SYSTEM_M->contStates);
    rtsiSetNumContStatesPtr(&ESP32_CONTROL_SYSTEM_M->solverInfo,
      &ESP32_CONTROL_SYSTEM_M->Sizes.numContStates);
    rtsiSetNumPeriodicContStatesPtr(&ESP32_CONTROL_SYSTEM_M->solverInfo,
      &ESP32_CONTROL_SYSTEM_M->Sizes.numPeriodicContStates);
    rtsiSetPeriodicContStateIndicesPtr(&ESP32_CONTROL_SYSTEM_M->solverInfo,
      &ESP32_CONTROL_SYSTEM_M->periodicContStateIndices);
    rtsiSetPeriodicContStateRangesPtr(&ESP32_CONTROL_SYSTEM_M->solverInfo,
      &ESP32_CONTROL_SYSTEM_M->periodicContStateRanges);
    rtsiSetContStateDisabledPtr(&ESP32_CONTROL_SYSTEM_M->solverInfo, (boolean_T**)
      &ESP32_CONTROL_SYSTEM_M->contStateDisabled);
    rtsiSetErrorStatusPtr(&ESP32_CONTROL_SYSTEM_M->solverInfo,
                          (&rtmGetErrorStatus(ESP32_CONTROL_SYSTEM_M)));
    rtsiSetRTModelPtr(&ESP32_CONTROL_SYSTEM_M->solverInfo,
                      ESP32_CONTROL_SYSTEM_M);
  }

  rtsiSetSimTimeStep(&ESP32_CONTROL_SYSTEM_M->solverInfo, MAJOR_TIME_STEP);
  rtsiSetIsMinorTimeStepWithModeChange(&ESP32_CONTROL_SYSTEM_M->solverInfo,
    false);
  rtsiSetIsContModeFrozen(&ESP32_CONTROL_SYSTEM_M->solverInfo, false);
  ESP32_CONTROL_SYSTEM_M->intgData.y = ESP32_CONTROL_SYSTEM_M->odeY;
  ESP32_CONTROL_SYSTEM_M->intgData.f[0] = ESP32_CONTROL_SYSTEM_M->odeF[0];
  ESP32_CONTROL_SYSTEM_M->intgData.f[1] = ESP32_CONTROL_SYSTEM_M->odeF[1];
  ESP32_CONTROL_SYSTEM_M->intgData.f[2] = ESP32_CONTROL_SYSTEM_M->odeF[2];
  ESP32_CONTROL_SYSTEM_M->contStates = ((X_ESP32_CONTROL_SYSTEM_T *)
    &ESP32_CONTROL_SYSTEM_X);
  ESP32_CONTROL_SYSTEM_M->contStateDisabled = ((XDis_ESP32_CONTROL_SYSTEM_T *)
    &ESP32_CONTROL_SYSTEM_XDis);
  ESP32_CONTROL_SYSTEM_M->Timing.tStart = (0.0);
  rtsiSetSolverData(&ESP32_CONTROL_SYSTEM_M->solverInfo, (void *)
                    &ESP32_CONTROL_SYSTEM_M->intgData);
  rtsiSetSolverName(&ESP32_CONTROL_SYSTEM_M->solverInfo,"ode3");
  rtmSetTPtr(ESP32_CONTROL_SYSTEM_M, &ESP32_CONTROL_SYSTEM_M->Timing.tArray[0]);
  rtmSetTFinal(ESP32_CONTROL_SYSTEM_M, -1);
  ESP32_CONTROL_SYSTEM_M->Timing.stepSize0 = 0.05;

  /* External mode info */
  ESP32_CONTROL_SYSTEM_M->Sizes.checksums[0] = (3094388579U);
  ESP32_CONTROL_SYSTEM_M->Sizes.checksums[1] = (638405739U);
  ESP32_CONTROL_SYSTEM_M->Sizes.checksums[2] = (3578876459U);
  ESP32_CONTROL_SYSTEM_M->Sizes.checksums[3] = (2890992735U);

  {
    static const sysRanDType rtAlwaysEnabled = SUBSYS_RAN_BC_ENABLE;
    static RTWExtModeInfo rt_ExtModeInfo;
    static const sysRanDType *systemRan[11];
    ESP32_CONTROL_SYSTEM_M->extModeInfo = (&rt_ExtModeInfo);
    rteiSetSubSystemActiveVectorAddresses(&rt_ExtModeInfo, systemRan);
    systemRan[0] = &rtAlwaysEnabled;
    systemRan[1] = &rtAlwaysEnabled;
    systemRan[2] = &rtAlwaysEnabled;
    systemRan[3] = &rtAlwaysEnabled;
    systemRan[4] = &rtAlwaysEnabled;
    systemRan[5] = &rtAlwaysEnabled;
    systemRan[6] = (sysRanDType *)
      &ESP32_CONTROL_SYSTEM_DW.IfActionSubsystem_SubsysRanBC;
    systemRan[7] = (sysRanDType *)
      &ESP32_CONTROL_SYSTEM_DW.PIDControl_SubsysRanBC;
    systemRan[8] = &rtAlwaysEnabled;
    systemRan[9] = &rtAlwaysEnabled;
    systemRan[10] = &rtAlwaysEnabled;
    rteiSetModelMappingInfoPtr(ESP32_CONTROL_SYSTEM_M->extModeInfo,
      &ESP32_CONTROL_SYSTEM_M->SpecialInfo.mappingInfo);
    rteiSetChecksumsPtr(ESP32_CONTROL_SYSTEM_M->extModeInfo,
                        ESP32_CONTROL_SYSTEM_M->Sizes.checksums);
    rteiSetTPtr(ESP32_CONTROL_SYSTEM_M->extModeInfo, rtmGetTPtr
                (ESP32_CONTROL_SYSTEM_M));
  }

  /* Start for If: '<Root>/If' */
  (void) memset(&(ESP32_CONTROL_SYSTEM_XDis.Integrator_CSTATE), 1,
                1*sizeof(boolean_T));
  ESP32_CONTROL_SYSTEM_DW.If_ActiveSubsystem = -1;

  /* InitializeConditions for Memory: '<S13>/Memory' */
  ESP32_CONTROL_SYSTEM_DW.Memory_PreviousInput =
    ESP32_CONTROL_SYSTEM_P.SRFlipFlop2_initial_condition;

