OLLYDOTDEV/Throttle_Body_Control_Platform/CODE/Research_And_Development/Matlab/CONTROL_SYSTEM/ESP32_CONTROL_SYSTEM_ert_rtw/ESP32_CONTROL_SYSTEM.c
  /* InitializeConditions for Memory: '<S11>/Memory' */
  ESP32_CONTROL_SYSTEM_DW.Memory_PreviousInput_f =
    ESP32_CONTROL_SYSTEM_P.SRFlipFlop_initial_condition;

  /* InitializeConditions for Memory: '<S12>/Memory' */
  ESP32_CONTROL_SYSTEM_DW.Memory_PreviousInput_n =
    ESP32_CONTROL_SYSTEM_P.SRFlipFlop1_initial_condition;

  /* SystemInitialize for MATLAB Function: '<Root>/Throttle Body Callibration' */
  ESP32_CONTROL_SYSTEM_DW.TB_minSet = 5.0;

  /* SystemInitialize for MATLAB Function: '<Root>/Pedal Calibration' */
  ESP32_CONTROL_SYSTEM_DW.maxSet = -1.0;
  ESP32_CONTROL_SYSTEM_DW.minSet = 5.0;

  /* SystemInitialize for IfAction SubSystem: '<Root>/If Action Subsystem' */
  /* SystemInitialize for SignalConversion generated from: '<S4>/In1' incorporates:
   *  Outport: '<S4>/Out1'
   */
  ESP32_CONTROL_SYSTEM_B.In1 = ESP32_CONTROL_SYSTEM_P.Out1_Y0;

  /* End of SystemInitialize for SubSystem: '<Root>/If Action Subsystem' */

  /* SystemInitialize for IfAction SubSystem: '<Root>/PID Control' */
  /* InitializeConditions for Derivative: '<S5>/Derivative' */
  ESP32_CONTROL_SYSTEM_DW.TimeStampA = (rtInf);
  ESP32_CONTROL_SYSTEM_DW.TimeStampB = (rtInf);

  /* InitializeConditions for Integrator: '<S5>/Integrator' */
  ESP32_CONTROL_SYSTEM_X.Integrator_CSTATE =
    ESP32_CONTROL_SYSTEM_P.Integrator_IC;

  /* SystemInitialize for Sum: '<S5>/Sum' incorporates:
   *  Outport: '<S5>/PID Output'
   *  Saturate: '<S5>/Saturation'
   */
  ESP32_CONTROL_SYSTEM_B.Saturation = ESP32_CONTROL_SYSTEM_P.PIDOutput_Y0;

  /* End of SystemInitialize for SubSystem: '<Root>/PID Control' */

  /* Start for MATLABSystem: '<S2>/ESP23_ANALOG_READ_DDAppGeneratedBlock1' */
  /*  Constructor */
  ESP32_CONTROL_SYSTEM_DW.obj_h.matlabCodegenIsDeleted = false;
  ESP32_CONTROL_SYSTEM_DW.obj_h.SampleTime =
    ESP32_CONTROL_SYSTEM_P.ESP23_ANALOG_READ_DDAppGenerate;
  ESP32_CONTROL_SYSTEM_DW.obj_h.isInitialized = 1;

  /*         %% Define output properties */
  /*   Check the input size */
  setupFunctionESP32_ANALOG_READ(34, 1.0);
  ESP32_CONTROL_SYSTEM_DW.obj_h.isSetupComplete = true;

  /* Start for MATLABSystem: '<S10>/ESP23_ANALOG_READ_DDAppGeneratedBlock' */
  /*  Constructor */
  ESP32_CONTROL_SYSTEM_DW.obj.matlabCodegenIsDeleted = false;
  ESP32_CONTROL_SYSTEM_DW.obj.SampleTime =
    ESP32_CONTROL_SYSTEM_P.ESP23_ANALOG_READ_DDAppGenera_p;
  ESP32_CONTROL_SYSTEM_DW.obj.isInitialized = 1;

  /*         %% Define output properties */
  /*   Check the input size */
  setupFunctionESP32_ANALOG_READ(35, 1.0);
  ESP32_CONTROL_SYSTEM_DW.obj.isSetupComplete = true;

  /* Start for MATLABSystem: '<S3>/PWM' */
  ESP32_CONTROL_SYSTEM_DW.obj_l.matlabCodegenIsDeleted = false;
  ESP32_CONTROL_SYSTEM_DW.obj_l.isInitialized = 1;
  ESP32_CONTROL_SYSTEM_DW.obj_l.PWMDriverObj.MW_PWM_HANDLE = MW_PWM_Open(2U,
    19000.0, 255.0);
  ESP32_CONTROL_SYSTEM_DW.obj_l.isSetupComplete = true;

  /* Start for MATLABSystem: '<S3>/Digital Output' */
  ESP32_CONTROL_SYSTEM_DW.obj_m.matlabCodegenIsDeleted = false;
  ESP32_CONTROL_SYSTEM_DW.obj_m.isInitialized = 1;
  digitalIOSetup(4, 1);
  ESP32_CONTROL_SYSTEM_DW.obj_m.isSetupComplete = true;

  /* Start for MATLABSystem: '<S3>/Digital Output1' */
  ESP32_CONTROL_SYSTEM_DW.obj_c.matlabCodegenIsDeleted = false;
  ESP32_CONTROL_SYSTEM_DW.obj_c.isInitialized = 1;
  digitalIOSetup(0, 1);
  ESP32_CONTROL_SYSTEM_DW.obj_c.isSetupComplete = true;

  /* Start for MATLABSystem: '<S3>/MATLAB System' */
  /*  Constructor */
  ESP32_CONTROL_SYSTEM_DW.obj_o.matlabCodegenIsDeleted = false;
  ESP32_CONTROL_SYSTEM_DW.obj_o.SampleTime =
    ESP32_CONTROL_SYSTEM_P.MATLABSystem_SampleTime;
  ESP32_CONTROL_SYSTEM_DW.obj_o.isInitialized = 1;

  /*         %% Define output properties */
  /*   Check the input size */
  /*     validateattributes(varargin{1},{'int16'},{'2d','size',[1,1]},'','Duty_Cycle_Percent'); */
  setupFunctionLEDC_INTERFACE(0, 1.0, 0, 1.0, 0, 1.0, 0, 1.0, 0LL, 1.0);
  ESP32_CONTROL_SYSTEM_DW.obj_o.isSetupComplete = true;
}

/* Model terminate function */
void ESP32_CONTROL_SYSTEM_terminate(void)
{
  /* Terminate for MATLABSystem: '<S2>/ESP23_ANALOG_READ_DDAppGeneratedBlock1' */
  if (!ESP32_CONTROL_SYSTEM_DW.obj_h.matlabCodegenIsDeleted) {
    ESP32_CONTROL_SYSTEM_DW.obj_h.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<S2>/ESP23_ANALOG_READ_DDAppGeneratedBlock1' */

  /* Terminate for MATLABSystem: '<S10>/ESP23_ANALOG_READ_DDAppGeneratedBlock' */
  if (!ESP32_CONTROL_SYSTEM_DW.obj.matlabCodegenIsDeleted) {
    ESP32_CONTROL_SYSTEM_DW.obj.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<S10>/ESP23_ANALOG_READ_DDAppGeneratedBlock' */
  /* Terminate for MATLABSystem: '<S3>/PWM' */
  if (!ESP32_CONTROL_SYSTEM_DW.obj_l.matlabCodegenIsDeleted) {
    ESP32_CONTROL_SYSTEM_DW.obj_l.matlabCodegenIsDeleted = true;
    ESP32_CONTRO_SystemCore_release(&ESP32_CONTROL_SYSTEM_DW.obj_l);
  }

  /* End of Terminate for MATLABSystem: '<S3>/PWM' */
  /* Terminate for MATLABSystem: '<S3>/Digital Output' */
  if (!ESP32_CONTROL_SYSTEM_DW.obj_m.matlabCodegenIsDeleted) {
    ESP32_CONTROL_SYSTEM_DW.obj_m.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<S3>/Digital Output' */
  /* Terminate for MATLABSystem: '<S3>/Digital Output1' */
  if (!ESP32_CONTROL_SYSTEM_DW.obj_c.matlabCodegenIsDeleted) {
    ESP32_CONTROL_SYSTEM_DW.obj_c.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<S3>/Digital Output1' */
  /* Terminate for MATLABSystem: '<S3>/MATLAB System' */
  if (!ESP32_CONTROL_SYSTEM_DW.obj_o.matlabCodegenIsDeleted) {
    ESP32_CONTROL_SYSTEM_DW.obj_o.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<S3>/MATLAB System' */
}

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
